app/views/noticia/index.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."noticium_id" = ?  [["noticium_id", 1]]
SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."noticium_id" = $1  [["noticium_id", 3]]
---
        <td><%= noticium.cuerpo.truncate(503) %></td>
        <td><%= noticium.comentarios.count %></td>