app/views/noticia/show.html.erb

<table>
<% @noticium.comentarios.each do |comentario| %>
---
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."noticium_id" = $1  [["noticium_id", 3]]