app/controllers/noticia_controller.rb

INSERT INTO "comentarios" ("fecha", "contenido", "noticium_id", "nombre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fecha", "2018-03-16"], ["contenido", "Comentario"], ["noticium_id", 3], ["nombre", "Felipe"], ["created_at", "2018-03-16 23:18:31.789716"], ["updated_at", "2018-03-16 23:18:31.789716"]]
---
  def comentar
    h = {
      contenido: params[:comment],
      noticium: @noticia,
      nombre: params[:author]
    }
    @comentario = Comentario.create(h)

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 6]]
---
  def eliminar_comentario
    comentario = Comentario.find(params[:c_id])
    h = {id: comentario.id,
        author: comentario.nombre,
        comment: comentario.contenido,
        created_at: comentario.created_at
    }
    comentario.destroy

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def mostrar_comentario
    comentario = Comentario.find(params[:c_id])

DELETE FROM "noticia" WHERE "noticia"."id" = $1  [["id", 2]]
---
  def destroy
    h = {id: @noticia.id,
        title: @noticia.titular,
        subtitle: @noticia.bajada,
        body: @noticia.cuerpo,
        created_at: @noticia.created_at
    }
    @noticia.destroy